In [27]:
import seaborn as sns
import pandas as pd

In [5]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [19]:
flight_df=sns.load_dataset("taxis")

In [21]:
flight_df.head()

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.60,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan
1,2019-03-04 16:11:55,2019-03-04 16:19:00,1,0.79,5.0,0.00,0.0,9.30,yellow,cash,Upper West Side South,Upper West Side South,Manhattan,Manhattan
2,2019-03-27 17:53:01,2019-03-27 18:00:25,1,1.37,7.5,2.36,0.0,14.16,yellow,credit card,Alphabet City,West Village,Manhattan,Manhattan
3,2019-03-10 01:23:59,2019-03-10 01:49:51,1,7.70,27.0,6.15,0.0,36.95,yellow,credit card,Hudson Sq,Yorkville West,Manhattan,Manhattan
4,2019-03-30 13:27:42,2019-03-30 13:37:14,3,2.16,9.0,1.10,0.0,13.40,yellow,credit card,Midtown East,Yorkville West,Manhattan,Manhattan

In [23]:
flight_df.describe()

,pickup,dropoff,passengers,distance,fare,tip,tolls,total
count,6433,6433,6433.000000,6433.000000,6433.000000,6433.00000,6433.000000,6433.000000
mean,2019-03-16 08:31:28.514223616,2019-03-16 08:45:49.491217408,1.539251,3.024617,13.091073,1.97922,0.325273,18.517794
min,2019-02-28 23:29:03,2019-02-28 23:32:35,0.000000,0.000000,1.000000,0.00000,0.000000,1.300000
25%,2019-03-08 15:50:34,2019-03-08 16:12:51,1.000000,0.980000,6.500000,0.00000,0.000000,10.800000
50%,2019-03-15 21:46:58,2019-03-15 22:06:44,1.000000,1.640000,9.500000,1.70000,0.000000,14.160000
75%,2019-03-23 17:41:38,2019-03-23 17:51:56,2.000000,3.210000,15.000000,2.80000,0.000000,20.300000
max,2019-03-31 23:43:45,2019-04-01 00:13:58,6.000000,36.700000,150.000000,33.20000,24.020000,174.820000
std,NaN,NaN,1.203768,3.827867,11.551804,2.44856,1.415267,13.815570

In [15]:
flight_df.isnull().sum()

pickup              0
dropoff             0
passengers          0
distance            0
fare                0
tip                 0
tolls               0
total               0
color               0
payment            44
pickup_zone        26
dropoff_zone       45
pickup_borough     26
dropoff_borough    45
dtype: int64

In [25]:
flight_df["payment"].head()

0    credit card
1           cash
2    credit card
3    credit card
4    credit card
Name: payment, dtype: object

In [33]:
flight_datetime= pd.to_datetime(flight_df["pickup"])
flight_datetime

0      2019-03-23 20:21:09
1      2019-03-04 16:11:55
2      2019-03-27 17:53:01
3      2019-03-10 01:23:59
4      2019-03-30 13:27:42
               ...
6428   2019-03-31 09:51:53
6429   2019-03-31 17:38:00
6430   2019-03-23 22:55:18
6431   2019-03-04 10:09:25
6432   2019-03-13 19:31:22
Name: pickup, Length: 6433, dtype: datetime64[ns]

In [190]:
titanic=sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [192]:
titanic["age"].isnull().sum()

177

In [194]:
titanic["age"].mean()

29.69911764705882

In [196]:
titanic["age"].median()

28.0

In [200]:
titanic['age']=titanic["age"].fillna(28)
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [202]:
del titanic['deck']

In [204]:
titanic.dropna(inplace= True)

In [206]:
titanic.isna().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
embark_town    0
alive          0
alone          0
dtype: int64

In [208]:
titanic.duplicated().sum()

116

In [210]:
titanic.drop_duplicates(inplace= True)

In [212]:
titanic.duplicated().sum()

0

In [214]:
titanic["age"].round(1)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
885    39.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: age, Length: 773, dtype: float64

In [216]:
titanic["fare"]=titanic["fare"].round(2)

In [218]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [220]:
titanic.rename(columns={"class":"Class"},inplace= True)

In [222]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'Class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [224]:
titanic.shape

(773, 14)

In [261]:
titanic['age']= titanic['age'].astype('int')
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Index: 773 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     773 non-null    int64
 1   pclass       773 non-null    int64
 2   sex          773 non-null    object
 3   age          773 non-null    int32
 4   sibsp        773 non-null    int64
 5   parch        773 non-null    int64
 6   fare         773 non-null    float64
 7   embarked     773 non-null    object
 8   Class        773 non-null    category
 9   who          773 non-null    object
 10  adult_male   773 non-null    bool
 11  embark_town  773 non-null    object
 12  alive        773 non-null    object
 13  alone        773 non-null    bool
dtypes: bool(2), category(1), float64(1), int32(1), int64(4), object(5)
memory usage: 71.8+ KB

In [263]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,Class,who,adult_male,embark_town,alive,alone
0,0,3,male,22,1,0,7.25,S,Third,man,True,Southampton,no,False
1,1,1,female,38,1,0,71.28,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26,0,0,7.92,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35,1,0,53.10,S,First,woman,False,Southampton,yes,False
4,0,3,male,35,0,0,8.05,S,Third,man,True,Southampton,no,True

In [277]:
titanic['embark_town'].unique()

array(['Southampton', 'Cherbourg', 'Queenstown'], dtype=object)

In [285]:
print("No of survived people is still alive:",len(titanic.query("survived == 1 and alive == 'yes'")))
print("No of survived people from first Class:",len(titanic.query("survived == 1 and Class == 'First' and sex == 'male'")))
print("No of survived people from Second Class",len(titanic.query("survived == 1 and Class == 'Second' and sex == 'male'")))
print("No of survived people from Third Class",len(titanic.query("survived == 1 and Class == 'Third' and sex == 'male'")))
print("------------------------------------------------------------------------------------------------")
print("Number of Female Survived",len(titanic.query("survived == 1 and sex == 'female'")))
print("Number of Male Survived",len(titanic.query("survived == 1 and sex == 'male'")))
print("No of Woman Surviver",len(titanic.query("survived == 1 and who == 'woman'")))
print("No of child Surviver",len(titanic.query("survived == 1 and who == 'child'")))
print("No of Man Surviver",len(titanic.query("survived == 1 and who == 'man'")))
print("------------------------------------------------------------------------------------------------")
print("No of survived  people from Cherbourg: ",len(titanic.query("survived == 1 and embark_town == 'Cherbourg'")))
print("No of survived people from Southampton: ",len(titanic.query("survived == 1 and embark_town == 'Southampton'")))
print("People not survived:",(titanic.shape)[0]-(len(titanic.query("survived == 1 and embark_town == 'Cherbourg'"))+len(titanic.query("survived == 1 and embark_town == 'Southampton'"))))
print("------------------------------------------------------------------------------------------------")

print("Number of surviver from age group 0 to 18:",len(titanic.query("survived == 1 and 0<= age >= 18 ")))
print("Number of surviver from age group 0 to 18:",len(titanic.query("survived == 1 and 18<= age >= 60 ")))
print("Number of surviver from age group 0 to 18:",len(titanic.query("survived == 1 and 60>= age  ")))

No of survived people is still alive: 318
No of survived people from first Class: 43
No of survived people from Second Class 17
No of survived people from Third Class 44
------------------------------------------------------------------------------------------------
Number of Female Survived 214
Number of Male Survived 104
No of Woman Surviver 187
No of child Surviver 48
No of Man Surviver 83
------------------------------------------------------------------------------------------------
No of survived  people from Cherbourg:  90
No of survived people from Southampton:  208
People not survived: 475
------------------------------------------------------------------------------------------------
Number of surviver from age group 0 to 18: 258
Number of surviver from age group 0 to 18: 6
Number of surviver from age group 0 to 18: 314

In [299]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,Class,who,adult_male,embark_town,alive,alone
0,0,3,male,22,1,0,7.25,S,Third,man,True,Southampton,no,False
1,1,1,female,38,1,0,71.28,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26,0,0,7.92,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35,1,0,53.10,S,First,woman,False,Southampton,yes,False
4,0,3,male,35,0,0,8.05,S,Third,man,True,Southampton,no,True

In [363]:
print("Number of people Total Class 1:",len(titanic.query("Class == 'First'")))
print("Number of people Total Class 1 female:",len(titanic.query("Class == 'First' and sex == 'female'"))/len(titanic.query("Class == 'First'"))*100)
print("Number of people Total Class 1 male:",len(titanic.query("(Class == 'First' and sex == 'male')"))/len(titanic.query("Class == 'First'"))*100)
print("--------------------------------------------------------------------------------------------------------------------------")
print("Number of people from age group 0 to 18:",len(titanic.query(" 0<= age >= 18 and Class == 'First'")))
print("Number of people from age group 18 to 35:",len(titanic.query(" 18<= age >= 35 and Class == 'First'")))
print("Number of people from age group 35 to 60:",len(titanic.query(" 35<= age >= 60 and Class == 'First'")))
print("Number of people from age group >60:",len(titanic.query(" age >60 and Class == 'First'")))
print("--------------------------------------------------------------------------------------------------------------------------")
print("Number of people from cherbourg:",len(titanic.query("embark_town == 'Cherbourg' and Class == 'First'")))
print("Number of people from Southampton:",len(titanic.query("embark_town == 'Southampton' and Class == 'First'")))
print("Number of people from Queenstown:",len(titanic.query("embark_town == 'Queenstown' and Class == 'First'")))

Number of people Total Class 1: 208
Number of people Total Class 1 female: 43.75
Number of people Total Class 1 male: 56.25
--------------------------------------------------------------------------------------------------------------------------
Number of people from age group 0 to 18: 196
Number of people from age group 18 to 35: 110
Number of people from age group 35 to 60: 15
Number of people from age group >60: 12
--------------------------------------------------------------------------------------------------------------------------
Number of people from cherbourg: 83
Number of people from Southampton: 123
Number of people from Queenstown: 2